<body>
現在私はこんなご時世もあり、在宅ワークを中心にして生活がなりたてられないかなと一念発起している最中だ。
そんな中、1月中旬私はとある求人が気になった。それは株式会社静岡オンラインの求人だ。
仕事内容はRudy,PHP,HTML,CSS,JavaScriptを中心とした作業だそうだ。RudyやPHPは触ったことがなく少々不安であったが、「プログラミングのご経験の有無は問いません」と書いてあるのでなんとかなるだろうと思い応募することにしてみた。
しかし応募することをきめたがいいが一つ気になることがある。それは「業務に慣れてくれば週２回までリモート勤務ＯＫ」と書いてあることだ。
在宅ワークで検索したはずだから大丈夫、、、だよな？と思いつつも1月23日思い立って電話してみることにした。
『もしもし、、、？あの（中略）』どうやら担当者が不在らしい。折り返しかけてくださるようだ。ありがたい
・・・ブーブーブー
『はいっ！？』（余談だが急に電話なるとびっくりするよね）
『こちら静岡オンラインーーー』
　　　　　　　・
　　　　　　　・
　　　　　　　・
要約するとこうだ
１.完全に在宅がしたければそれなりの実力がいる
２.さっさとgithubでphpとかRubyとかで作ったものを送ってこい　メールでな
ということらしい（そういや担当の方喉痛めていたけれども大丈夫だったのかしら）
んで何を思ってしまったのか私は
『数日から一週間の間に出します』
と答えてるんだなこれが
いや言い訳をさせてくれ
だって早い方がいいと思ったんだもん！あと電話で直接やり取りすると焦っちゃうよね！そんなことない？そんなことあるんだよ！てかなんで言った？
てなわけでわざわざ自分の首を絞めてしまった一周間のLOGを下記に記載する
お見苦しいものを大変申し訳ございません。なお、一部のものに多少の誇張や言葉遣いの粗さがありますがご了承お願いします。

C:\Users>echo 1月24日
数日から一週間って答えてしまったなぁとりあえずgithub聞いたこともあるし知ってるんだけど肝心なことに使ったことがないんだよねぇ
でも提出するためにはこれに入れて出さなきゃいけないし使ってみよう。なになにここにユーザーとパスワードを、、、パスワードが通らないんだけど！？
え、（一時間後）いやなんで！？（もうしばらくして）あぁ、、、！（）あ！これパスワードってかいてあるくせにトークン入力じゃないか！
いやなに食わぬ顔でpassword:とか書かないで！？お願いだから更新してよぉぉ！
ちちかれた、、、そういやhtmlも業務内容的なことかいてあったな久しぶりにレンタルサーバーでも動かして、、、うーん一個ずつフォルダ動かすのめんどくさいなまとめて移動できないもんか
お、FTP通信すればいけるくさいな　ん？あれうまくうごかな、、あ、うご、、動いた！　あぁもうこんな時間かおやすみなさい

C:\Users>echo 1月25日
昨日は結局いろいろ調整して終わったなぁ
そうだ！レンタルサーバーあるしページつくってそのまま送るか！そっちの方が楽だし！（今考えたけどなにが楽だったんだろう）
えーとFTP通信ちゃんと動くな、よしよし。どうせだから便利そうなページつくろーっと
あと友達にもなにかと便利で共有しやすいページも作っておいてと、、、（なんかいろいろ）あ、やばい脱線してたもういい時間だおやすみなさい

C:\Users>echo 1月26日
結局昨日はページ作れずに終わってしまった
静岡オンライン様に出すようにページをつくらないと、
あ、でも便利だからyoutubeとかもおいていいて、（無駄）ん？ボタン配置がうまくできないてか背景がうまく反映されてないし、あれこのタグとこのタグってetc

C:\Users>echo 1月27日
うまく配置できないなとか色とか気になったりとか結局なんのページ作るのだったのかしらとか考えていたらいつの間にか4日目そういやRubyとかまだノータッチだった。
いやでも成果物ぽいのつくらないといけないしいじってるカタンのコピーサイトを成果物としてもう一度いじりなおして、、、
ちょっとまてカタンのページってローカルで動けるようにしたけどローカル以外まだ動かせないよな
理由がたしかローカルでWebSocket通信はうまくできるんだけどレンタルサーバーでしようとするとetc
C:\Users>echo 1月28日
んでレンタルサーバーでWebSocketができない理由が、、、あ、PHPってこうやって使うのか
おーレンタルサーバーでコンソール動かせるようになったよ感動これでphpも稼働できるな
でもなんかハンドシェイクがうまくいかないうーーーん
C:\Users>echo 1月29日
あいろいろ悩んでたら提出最終締め切り日が明日じゃないかやばいなあんかエセページつくっただけでまだなにも作ってないしカタンもうまくいかないしえ、なにを提出して形を保っておけば、、、！
うーんそういえばRubyさわってないさわらないと　でもかたn(作業)
C:\Users>echo 1月30日
なんやかんやで一週間がすぎてしまった。明日から三日間ほど家の手伝いで駆り出されるため今日中に静岡オンラインに提出しなければ
というかこの段階で気づいたのだがRubyってゲームとかを作るプログラムだからまぁその辺のコードを引っ張て来て動かせればそれでいいのかなとかぼんやり考えていたのだけれど、
Rubyの必要されているスキルってもしかしてウェブアプリケーションのほうでは！？Rilsでフレームワークをつくるのか。くっ気づくのが遅かった環境から作らねば
あーーー！やっぱりRilsのために環境整えようとするとエラーでますよね！そうですよね！チュートリアルはチュートリアルじゃないだいたいなんかエラーがでる
この感じ環境整えるだけで1日はつぶれるうっまにあわっ、（ぶっ通し）
C:\Users>echo today
今日です　6時です　やべぇ間に合わねぇと思ってこの記事を書き始めたのが4時でした。え、？うせやろ？
まだgithubも履歴書準備してないよ！？そもそもこの記事もまだ反映させてないよ！？あと2時間後には家出るよ！？うぉぉぉ！まにあえーーー！
</body>